###############################################################################
# Created by write_sdc
###############################################################################
current_design aes
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 7.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.5000 clk
set_propagated_clock [get_clocks {clk}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[0]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[10]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[11]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[12]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[13]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[14]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[15]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[16]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[17]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[18]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[19]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[1]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[20]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[21]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[22]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[23]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[24]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[25]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[26]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[27]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[28]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[29]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[2]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[30]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[31]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[3]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[4]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[5]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[6]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[7]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[8]}]
set_output_delay 0.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {read_data[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {read_data[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0300 [get_ports {read_data[31]}]
set_load -pin_load 0.0300 [get_ports {read_data[30]}]
set_load -pin_load 0.0300 [get_ports {read_data[29]}]
set_load -pin_load 0.0300 [get_ports {read_data[28]}]
set_load -pin_load 0.0300 [get_ports {read_data[27]}]
set_load -pin_load 0.0300 [get_ports {read_data[26]}]
set_load -pin_load 0.0300 [get_ports {read_data[25]}]
set_load -pin_load 0.0300 [get_ports {read_data[24]}]
set_load -pin_load 0.0300 [get_ports {read_data[23]}]
set_load -pin_load 0.0300 [get_ports {read_data[22]}]
set_load -pin_load 0.0300 [get_ports {read_data[21]}]
set_load -pin_load 0.0300 [get_ports {read_data[20]}]
set_load -pin_load 0.0300 [get_ports {read_data[19]}]
set_load -pin_load 0.0300 [get_ports {read_data[18]}]
set_load -pin_load 0.0300 [get_ports {read_data[17]}]
set_load -pin_load 0.0300 [get_ports {read_data[16]}]
set_load -pin_load 0.0300 [get_ports {read_data[15]}]
set_load -pin_load 0.0300 [get_ports {read_data[14]}]
set_load -pin_load 0.0300 [get_ports {read_data[13]}]
set_load -pin_load 0.0300 [get_ports {read_data[12]}]
set_load -pin_load 0.0300 [get_ports {read_data[11]}]
set_load -pin_load 0.0300 [get_ports {read_data[10]}]
set_load -pin_load 0.0300 [get_ports {read_data[9]}]
set_load -pin_load 0.0300 [get_ports {read_data[8]}]
set_load -pin_load 0.0300 [get_ports {read_data[7]}]
set_load -pin_load 0.0300 [get_ports {read_data[6]}]
set_load -pin_load 0.0300 [get_ports {read_data[5]}]
set_load -pin_load 0.0300 [get_ports {read_data[4]}]
set_load -pin_load 0.0300 [get_ports {read_data[3]}]
set_load -pin_load 0.0300 [get_ports {read_data[2]}]
set_load -pin_load 0.0300 [get_ports {read_data[1]}]
set_load -pin_load 0.0300 [get_ports {read_data[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.5000 [current_design]
